function LupEceMaProgram() {
    return(
      <div className=" w-full siemreap-regular  p-4">
      <h1 className="siemreap-regular text-start">
        ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា MA
      </h1>
      <h1 className="siemreap-regular text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
      <p className="siemreap-regular px-7 py-4 text-start">● ការណែនាំអំពីកម្មវិធី</p>
      <p className="siemreap-regular px-10 py-1 text-justify">
      កម្មវិធីនេះត្រូបានរៀបចំឡើងដើម្បីត្រៀមលក្ខណៈរបស់អ្នកសិក្សាឱ្យក្លាយជាអ្នកអប់រំដែលមានគុណភាព និងជាភ្នាក់ងារកំណែទម្រង់ក្នុងការផ្លាស់ប្ដូរការលូតលាស់របស់កុមារ។ កម្មវិធីនេះផ្ដល់នូវការយល់ដឹងស៊ីជម្រៅពី មូលដ្ឋានគ្រឹះជាទ្រឹស្ដី និងគោលគំនិតសំខាន់ៗនៃការអប់រំកុមារតូច ការគ្រប់គ្រងអប់រំ និងយុទ្ធសាស្ត្រសហគមន៍សាលារៀន។ កម្មវិធីនេះផ្សារភ្ជាប់ទ្រឹស្ដី ទៅនឹងការអនុវត្តជាក់ស្ដែងនៅសាលារៀន ដោយសង្កត់ធ្ងន់លើការលូតលាស់ និងការរៀនរបស់កុមារតូច។ តាមរយៈការរួមបញ្ចូលនូវទ្រឹស្ដី និងការអនុវត្ត អ្នកសិក្សាបណ្ដុះនូវចំណេះដឹងជាក់ស្ដែង សមត្ថភាពដឹកនាំ និងជំនាញវិជ្ជាជីវៈដែលត្រូវការ ដើម្បីកែលម្អការអប់រំកុមារតូចនៅកម្រិតសាលារៀន និងសហគមន៍។
      </p>
      <p className="siemreap-regular px-7 py-4 text-start">
        ● កម្មវិធីរួមបញ្ចូល (មុខវិជ្ជាគោល)
      </p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
        <p>កម្មវិធីនេះបណ្ដុះនូវសមត្ថភាពពេញលេញលើផ្នែកបីសំខាន់ៗដូចជា៖</p>
        <p>១. ការសិក្សាអំពីការអប់រំកុមារតូច</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	ការអភិវឌ្ឍនៃការអប់រំកុមារតូច</p>
          <p>
            ●	ការអភិវឌ្ឍគ្រប់ផ្នែករបស់កុមារ
          </p>
          <p>
            ●	ការសហការ និងការគាំទ្រពីផ្ទះ សាលារៀន និងសហគមន៍ដើម្បីកុមារ
          </p>
        </div>
        <p>២. ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រង</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>
            ●	ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងរដ្ឋបាលសាលារៀន
          </p>
          <p>●	ការគ្រប់គ្រងអប់រំក្នុងបរិបទការអប់រំកុមារតូច</p>
          <p>●	យុទ្ធសាស្ត្រដឹកនាំសម្រាប់សាលាមានប្រសិទ្ធភាព និងស្ថេរភាព</p>
        </div>
        <p>៣. ការអនុវត្ត និងនិក្ខេបបទ</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	ការអនុវត្តការគ្រប់គ្រងតាមសាលារៀន</p>
          <p>●	យុទ្ធសាស្ត្រសហគមន៍សាលារៀន</p>
          <p>
            ●	ការចូលរួមអនុវត្តក្នុងបរិស្ថានសាលារៀន
          </p>
          <p>
            ●	ការស្រាវជ្រាវ ការសរសេរសារណាបញ្ចប់ ស្របតាមស្ដង់ដាសាលារៀនមានប្រសិទ្ធភាព
          </p>
        </div>
      </div>
      <p className="siemreap-regular px-7 py-4 text-start">● លទ្ធផលសិក្សានៃកម្មវិធី (PLOs)</p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
        <p className="siemreap-regular text-justify">
          ● នៅពេលដែលបញ្ចប់កម្មវិធីសិក្សានេះ អ្នកសិក្សានឹងមានសមត្ថភាព៖
          <br />
          &nbsp;&nbsp;PLO1៖ ពន្យល់លម្អិតអំពីទ្រឹស្ដី ទស្សនៈ និងគោលការណ៍ការអប់រំទាំងនៅកម្រិតថ្នាក់ជាតិ និងសកលលោក និងឆ្លុះបញ្ចាំងអំពីការអនុវត្តជាក់ស្ដែងរបស់ខ្លួននៅមត្តេយ្យសិក្សា។
          <br />
          &nbsp;&nbsp;PLO2៖  ពន្យល់លម្អិតអំពីដំណើរការការអនុវត្តដែលតម្រូវ ដើម្បីបង្វឹកសាលាឱ្យអនុវត្តយុទ្ធសាស្ត្រសហគមន៍សាលារៀនយ៉ាងមានប្រសិទ្ធភាព។
          <br />
          &nbsp;&nbsp;PLO3៖ បណ្ដុះនូវគំរូភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងសាលារៀន ដោយផ្ដោតលើលទ្ធផលសិក្សាកុមារ ប្រសិទ្ធផល ប្រសិទ្ធភាព និងស្ថេរភាពសាលារៀន តាមរយៈការសិក្សា ការអនុវត្ត និងការស្រាវជ្រាវ។
          <br />
          &nbsp;&nbsp;PLO4៖ ប្រើប្រាស់ទស្សនៈ ចំណេះដឹង និងជំនាញការអភិវឌ្ឍ និងការអប់រំកុមារតូច ដើម្បីបង្កើតឱ្យមានការផ្លាស់ប្ដូរបែបវិជ្ជមានក្នុងការថែទាំ និងការអប់រំកុមារតូច នៅកម្រិតសាលារៀន។
          <br />
          &nbsp;&nbsp;PLO5៖ បង្កើតយន្តការសម្រាប់ការគ្រប់គ្រង តាមដាន និងវាយតម្លៃការអនុវត្តការគ្រប់គ្រងតាមសាលារៀន និង យុទ្ធសាស្ត្រសហគមន៍សាលារៀនក្នុងការអប់រំកុមារតូច។
          <br />
          &nbsp;&nbsp;PLO6៖ អនុវត្តភាពជាអ្នកដឹកនាំ ការគ្រប់គ្រងការងារ ការប្រឹក្សាគរុកោសល្យ បំណិនរកចំណូល និងកម្មវិធីគាំពារសង្គម សម្រាប់សាលារៀន និងសហគមន៍ដោយផ្អែកលើក្រមសីលធម៌វិជ្ជាជីវៈ។
          <br />
          &nbsp;&nbsp;PLO7៖ បណ្ដុះឥរិយាបថវិជ្ជមាន និងវប្បធម៌រៀនពេញមួយជីវិត និងការទំនាក់ទំនង ប្រកបដោយការគោរព មនុស្សធម៌ សាមគ្គីភាព និងស្មារតីចែករំលែក។
          <br />
          &nbsp;&nbsp;PLO8៖ បង្ហាញផ្នត់គំនិតដឹកនាំដែលគាំទ្រដល់ការបង្កើតបណ្តាញដ៏រឹងមាំ និងលើកកម្ពស់ឧត្តមភាពនៅក្នុងស្ថាប័នគ្រប់គ្រងអប់រំ។
        </p>
      </div>
    </div>
    )
}

export default LupEceMaProgram