function DetailFourCredit() {
  return (
    <div className=" w-full siemreap-regular  p-4">
      <h1 className="siemreap-regular text-start">
        ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា
      </h1>
      <h1 className=" text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
      <p className=" px-7 py-4 text-start">● ការណែនាំអំពីកម្មវិធី</p>
      <p className=" px-10 py-1 text-justify">
        កម្មវិធីវិញ្ញាបនបត្រនេះត្រូវបានរៀបចំឡើងដើម្បីត្រៀមលក្ខណៈអ្នកអប់រំកុមារតូច
        និងគណៈគ្រប់គ្រងសាលារៀនឱ្យក្លាយជាភ្នាក់ងារកំណែទម្រង់មានប្រសិទ្ធភាពក្នុងសាលារៀន
        និងសហគមន៍របស់ខ្លួន។ កម្មវិធីនេះរួមបញ្ចូលនូវ មូលដ្ឋានគ្រឹះទ្រឹស្ដី
        បំណិនអនុវត្ត និងយុទ្ធសាស្ត្រអនុវត្ត ដើម្បីកែលម្អការបង្រៀន ការរៀន
        និងការគ្រប់គ្រងរដ្ឋបាលនៅកម្រិតមត្តេយ្យសិក្សា។
        អ្នកសិក្សានឹងទទួលបានសមត្ថភាពអនុវត្តបច្ចេកវិទ្យាអប់រំ ការតាមដានទិន្នន័យ
        ការរៀបចំកម្មវិធីសិក្សា ការសិក្សាពីចិត្តសង្គម
        និងភាពជាអ្នកដឹកនាំនៅមត្តេយ្យសិក្សា
        ដែលអាចធ្វើឱ្យពួកគាត់ពង្រឹងនូវលទ្ធផលសិក្សារបស់កុមារ និងសកម្មភាពសាលារៀន។
        កម្មវិធីនេះសង្កត់ធ្ងន់លើការអនុវត្តជាក់ស្តែង ការស្រាវជ្រាវបែបអនុវត្ត
        និងការរៀនបែបឆ្លុះបញ្ចាំងនៅកម្រិតសាលារៀន និងសហគមន៍។
      </p>
      <p className=" px-7 py-4 text-start">
        ● កម្មវិធីរួមបញ្ចូល (មុខវិជ្ជាគោល)
      </p>
      <div className="px-10 py-1 flex flex-col items-start">
        <p>១. បច្ចេកវិទ្យាអប់រំ និងប្រព័ន្ធតាមដានទិន្នន័យសិក្សា</p>
        <div className="px-12 py-1 flex flex-col items-start">
          <p>● ICT សម្រាប់ការរៀន និងបង្រៀននៅកម្រិតការអប់រំកុមារតូច</p>
          <p>
            ● ការប្រើប្រាស់ប្រព័ន្ធតាមដានទិន្នន័យដើម្បីតាមដានការសិក្សារបស់កុមារ
            និងការអនុវត្តការងាររបស់សាលារៀន
          </p>
        </div>
        <p>២. កម្មវិធីសិក្សា គរុកោសល្យ និងនវានុវត្តន៍</p>
        <div className="px-12 py-1 flex flex-col items-start">
          <p>
            ● កម្មវិធីសិក្សា និងវិធីសាស្ត្របង្រៀនស្តីពីការសិក្សាចិត្តសង្គម
            និងអារម្មណ៍ (SEL) បែបអនុវត្ត
          </p>
          <p>● នវានុវត្តន៍កអប់រំក្នុងកម្មវិធីអប់រំកុមារតូច</p>
          <p>● ការធ្វើរបាយការណ៍ និងការអនុវត្តការឆ្លុះបញ្ចាំង</p>
        </div>
        <p>៣. ភាពជាអ្នកដឹកនាំ ការគ្រប់គ្រងរដ្ឋបាល និងការអនុវត្ត</p>
        <div className="px-12 py-1 flex flex-col items-start">
          <p>● ការគ្រប់គ្រងរដ្ឋបាលនៅមត្តេយ្យសិក្សា និងបទពិសោធន៍កម្មសិក្សា</p>
          <p>● ការអនុវត្តស្ដង់ដាសាលាគំរូសម្រាប់មត្តេយ្យសិក្សា និងសមិទ្ធកម្ម</p>
          <p>
            ● យុទ្ធសាស្ត្រដឹកនាំ និងគ្រប់គ្រងដើម្បីទទួលបានប្រសិទ្ធភាពសាលារៀន
          </p>
        </div>
      </div>
      <p className=" px-7 py-4 text-start">● លទ្ធផលសិក្សារំពឹងទុកនៃកម្មវិធី</p>
      <div className="px-10 py-1 flex flex-col items-start">
        <p className="text-justify">
          ● នៅពេលដែលបញ្ចប់កម្មវិធីសិក្សានេះ អ្នកសិក្សានឹងមានសមត្ថភាព៖
          <br />
          &nbsp;&nbsp;PLO1៖ ពន្យល់អំពីទ្រឹស្ដីសំខាន់ៗ គោលការណ៍
          និងការអនុវត្តប្រសើរបំផុត ក្នុងការអប់រំកុមារតូច ភាពជាអ្នកដឹកនាំ
          និងនវានុវត្តន៍។
          <br />
          &nbsp;&nbsp;PLO2៖ យល់ដឹងអំពីការប្រើប្រាស់ ICT
          និងប្រព័ន្ធតាមដានទិន្នន័យដើម្បីកែលម្អការសិក្សារបស់កុមារ
          និងសកម្មភាពសាលារៀន។
          <br />
          &nbsp;&nbsp;PLO3៖ ប្រើប្រាស់ជំនាញជាក់ស្ដែងក្នុងការរចនា
          និងអនុវត្តតាមកម្មវិធីសិក្សាការអប់រំកុមារតូច
          និងវិធីសាស្ត្របង្រៀនដែលមានប្រសិទ្ធភាព។
          <br />
          &nbsp;&nbsp;PLO4៖ប្រើប្រាស់យុទ្ធសាស្ត្រដឹកនាំ និងគ្រប់គ្រង
          ដើម្បីកែលម្អរដ្ឋបាលសាលាមត្តេយ្យសិក្សា និងការអនុវត្តនៅកម្រិតសាលារៀន។
          <br />
          &nbsp;&nbsp;PLO5៖ អនុវត្តការស្រាវជ្រាវប្រតិបត្តិ លទ្ធផលរាយការណ៍
          និងការស្នើរដំណោះស្រាយសមស្រប ដើម្បីពង្រឹងលទ្ធផលថ្នាក់រៀន និងសាលារៀន។
          <br />
          &nbsp;&nbsp;PLO6៖ មានក្រមសីលធម៌វិជ្ជាជីវៈ ការអនុវត្តការឆ្លុះបញ្ចាំង
          និងភាពជាអ្នកដឹកនាំប្រកបដោយកិច្ចសហប្រតិបត្តិការនៅកម្រិតសាលារៀន
          និងសហគមន៍។
          <br />
          &nbsp;&nbsp;PLO7៖ បង្ហាញនូវភាពច្នៃប្រឌិត នវានុវត្តន៍
          និងការប្ដេជ្ញាចិត្តដើម្បីកែលម្អការសិក្សាចិត្តសង្គម
          និងការអភិវឌ្ឍគ្រប់ផ្នែកទាំងអស់សម្រាប់កុមារតូច។
        </p>
      </div>
    </div>
  );
}

export default DetailFourCredit;
