
export default function LupSePhdProgram(){
  const LUP_SE_PHD=[
    {
    courseDescription:"កម្មវិធីថ្នាក់បណ្ឌិត ឯកទេសគ្រប់គ្រងអប់រំ និងយុទ្ធសាស្រ្តសហគមន៍សាលារៀនមធ្យមសិក្សា(EdD LUP) ដែលត្រូវបានអនុវត្តក្រោមគម្រោងកែលម្អការអប់រំទូទៅ - ហិរញ្ញប្បទានបន្ថែម (GEIP-AF) គឺជាកម្មវិធីបណ្ឌិតវិជ្ជាអប់រំ ដែលត្រូវបានរចនាឡើងដើម្បីអភិវឌ្ឍអ្នកដឹកនាំអប់រំកម្រិតខ្ពស់ អ្នកបង្កើតគោលនយោបាយ និងអ្នកអនុវត្តសិក្សា។ កម្មវិធីនេះបណ្តុះបណ្តាលអ្នកសិក្សាជាមួយនឹងសមត្ថភាពទ្រឹស្តី បំណិនស្រាវជ្រាវ និងភាពជាអ្នកដឹកនាំដែលជំនាញត្រូវការដើម្បីដោះស្រាយបញ្ហាប្រឈមនៅក្នុងប្រព័ន្ធអប់រំ។កម្មវិធីសិក្សារួមបញ្ចូលមានដូចជា៖ ការសិក្សាកម្រិតខ្ពស់ក្នុងទស្សនវិជ្ជាអប់រំ ភាពជាអ្នកដឹកនាំនិងរដ្ឋបាល វិធីសាស្រ្តស្រាវជ្រាវ ការវិភាគគោលនយោបាយ និងការសម្រេចចិត្តដោយផ្អែកលើទិន្នន័យ។ បន្ថែមពីនេះ កម្មវិធីបានផ្តល់ជូនអ្នកសិក្សានូវមធ្យាបាយចម្រុះទាំងការសិក្សាតាមអ៊ីនធឺណិត និងសិក្សាដោយផ្ទាល់ ដែលធានានូវភាពបត់បែន ខណៈពេលដែលរក្សាបាននូវស្តង់ដាសិក្សាខ្ពស់។ អ្នកសិក្សាបញ្ចប់ការសិក្សាត្រូវបានរំពឹងថានឹងបង្ហាញភាពជាអ្នកដឹកនាំប្រកបដោយសីលធម៌ខ្ពស់ ការត្រឹះរិះពិចារណា ការវិភាគ និងការសម្រេចចិត្តដោយផ្អែកលើមូលដ្ឋានការស្រាវជ្រាវ ដែលអាចឱ្យពួកគេមានឱកាសចូលរួមចំណែកដល់ការកែលម្អការអប់រំ កំណែទម្រង់គោលនយោបាយ និងការអភិវឌ្ឍប្រកបដោយចីរភាពនៅកម្រិតស្ថាប័ន ជាតិ និងអន្តរជាតិ។",
    competencyPackages:[
    {
      id: 1,
      title: "សមត្ថភាពចំណេះដឹងខ្លឹមសារមេរៀន (១២ ក្រេឌីត)",
      subjects: [
        "	ទស្សនវិជ្ជាអប់រំកម្រិតខ្ពស់",
        "	វិធីសាស្រ្តស្រាវជ្រាវកម្រិតខ្ពស់",
        "	ការគ្រប់គ្រងតាមបែបការផ្លាស់ប្តូរ និងភាពជាអ្នកដឹកនាំជាប្រព័ន្ធ",
        "	អភិបាលកិច្ច និងគោលនយោបាយអប់រំកម្រិតខ្ពស់",
        "	ការគ្រប់គ្រងធនធាន និងហិរញ្ញវត្ថុអប់រំ",
        "	ការគ្រប់គ្រងធនធានមនុស្ស និងការអភិវឌ្ឍស្ថាប័ន/អង្គភាព"

      ]
    },
    {
      id: 2,
      title: "សមត្ថភាពចំណេះដឹងគរុកោសល្យ និងការសិក្សាអប់រំ (១២ ក្រេឌីត)",
      subjects: [
        "	ទ្រឹស្តី និងការអនុវត្តអភិបាលកិច្ចអប់រំ ",
        "	ការអនុវត្ត និងក្របខណ្ឌការបង្វឹក",
        "	ការដឹកនាំឆ្ពោះទៅកាន់បរិយាបន្ន និងចីរភាពសាលារៀន",
        "	គណនេយ្យភាព និងការវាយតម្លៃកម្មវិធីបណ្តុះបណ្តាល",
        "	គោលនយោបាយ និងការសម្រេចចិត្តដោយផ្អែកលើទិន្នន័យក្នុងអភិបាលកិច្ចអប់រំ"

      ]
    },
    {
      id: 3,
      title: "សមត្ថភាពចំណេះដឹងសិក្សាស្រាវជ្រាវ និងការអនុវត្តជាក់ស្តែង (៣៣ ក្រេឌីត)",
      subjects: [
        "	សំណើរនិក្ខេបបទស្រាវជ្រាវ",
        "	និក្ខេបបទស្រាវជ្រាវ (ការបោះពុម្ពអត្ថបទស្រាវជ្រាវ ការចូលរួមជាវាគ្មិនក្នុងសិក្ខាសាលាស្រាវជ្រាវថ្នាក់ជាតិ និងអន្តរជាតិ...)។",
        "សម្គាល់៖ មុខវិជ្ជាមានសញ្ញា * ជាមុខវិជ្ជាជម្រើស"
      ]
    }],
    programLearningOutcomes:[
      {
        category: "",
        plos: [
          {
            id: "PLO1",
            titleKh: "",
            titleEn: "",
            description: "ចំណេះដឹង និងការយល់ដឹងកម្រិតខ្ពស់៖ បង្ហាញពីចំណេះដឹងកម្រិតខ្ពស់ និងជាប្រព័ន្ធអំពីភាពជាអ្នកដឹកនាំ ការគ្រប់គ្រង គោលនយោបាយ និងអភិបាលកិច្ចអប់រំ ដែលមានមូលដ្ឋានលើទ្រឹស្តីទស្សនវិជ្ជាទំនើប និងឧត្តម្មានុវត្តជាសកល។"
          },
          {
            id: "PLO2",
            titleKh: "",
            titleEn: "",
            description: "ជំនាញស្រាវជ្រាវ និងការរុករក៖ រៀបចំ អនុវត្ត និងវាយតម្លៃការស្រាវជ្រាវដោយឯករាជ្យ ដោយប្រើវិធីសាស្រ្តស្រាវជ្រាវតាមបែបគុណវិស័យ បរិមាណវិស័យ និងវិធីសាស្រ្តស្រាវជ្រាវតាមចម្រុះសមស្រប ដើម្បីដោះស្រាយបញ្ហាប្រឈមក្នុងប្រព័ន្ធអប់រំ។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO3",
            titleKh: "",
            titleEn: "",
            description: "បំណិនការគិតតាមបែបត្រឹះរិះពិចារណា និងការវិភាគតាមបែបស៊ីជម្រៅ៖ វិភាគបញ្ហាគោលនយោបាយ និងការអនុវត្តរបស់ស្ថាប័ន/អង្គភាពអប់រំប្រកបដោយការត្រឹះរិះពិចារណាដោយផ្អែកលើទិន្នន័យ ភស្តុតាង និងបរិបទនានាសម្រាប់ជាមូលដ្ឋានធ្វើការសម្រេចចិត្ត និងកំណែទម្រង់អប់រំ។"
          },
          {
            id: "PLO4",
            titleKh: "",
            titleEn: "",
            description: "សមត្ថភាពភាពជាអ្នកដឹកនាំ៖ បង្ហាញពីសមត្ថភាពភាពជាអ្នកដឹកនាំដែលប្រកបដោយប្រសិទ្ធភាព សីលធម៌ និងសមារហកម្ម ដើម្បីដឹកនាំអង្គភាពអប់រំតាមរយៈគ្រប់គ្រងតាមបែបការផ្លាស់ប្តូរ និងលើកកម្ពស់ការកែលម្អជាបន្តបន្ទាប់នៅកម្រិតស្ថាប័ន និងប្រព័ន្ធ។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO5",
            titleKh: "",
            titleEn: "",
            description: "ចំណេះដឹងគោលនយោបាយ និងអភិបាលកិច្ច៖ អនុវត្តការយល់ដឹងកម្រិតខ្ពស់អំពីគោលនយោបាយអប់រំ អភិបាលកិច្ច និងក្របខណ្ឌគណនេយ្យភាព ដែលជះឥទ្ធិពលដល់ការអភិវឌ្ឍ ការអនុវត្ត និងការវាយតម្លៃគោលនយោបាយនៅកម្រិតជាតិ និងស្ថាប័ន។"
          },
          {
            id: "PLO6",
            titleKh: "",
            titleEn: "",
            description: "ជំនាញទំនាក់ទំនង និងការផ្សព្វផ្សាយ៖ យល់ដឹងយ៉ាងច្បាស់លាស់ និងអាចបញ្ចុះបញ្ចូលភាគីពាក់ព័ន្ធតាមរយៈការសរសេរសិក្សា បទបង្ហាញតាមសន្និសីទ និងបង្ហាញលទ្ធផលដែលផ្តោតលើគោលនយោបាយអប់រំ។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO7",
            titleKh: "",
            titleEn: "",
            description: "បំណិននវានុវត្តន៍ និងការដោះស្រាយបញ្ហា៖ អភិវឌ្ឍ និងអនុវត្តដំណោះស្រាយប្រកបដោយភាពច្នៃប្រឌិត លើបញ្ហាប្រឈមក្នុងវិស័យអប់រំ ដោយរួមបញ្ចូលភស្តុតាងស្រាវជ្រាវ ឧបករណ៍បច្ចេកវិទ្យា និងការពិតជាក់ស្តែងតាមបរិបទនានា។"
          },
          {
            id: "PLO8",
            titleKh: "",
            titleEn: "",
            description: "សមត្ថភាពអនុវត្តប្រកបដោយសីលធម៌ គុណតម្លៃ និងទំនួលខុសត្រូវសង្គម៖ បង្ហាញពីភាពស្មោះត្រង់ ក្រមសីលធម៌វិជ្ជាជីវៈ និងទំនួលខុសត្រូវសង្គម ដោយលើកកម្ពស់សមធម៌ សមារហកម្ម និងការអភិវឌ្ឍប្រកបដោយនិរន្តរភាពក្នុងការអនុវត្តភាពជាអ្នកដឹកនាំ និងការស្រាវជ្រាវ។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO9",
            titleKh: "",
            titleEn: "",
            description: "បំណិនការរៀនសូត្រពេញមួយជីវិត និងការអភិវឌ្ឍវិជ្ជាជីវៈ៖ ចូលរួមក្នុងការរៀនសូត្រពេញមួយជីវិតតាមរយៈស្វ័យសិក្សា និងការអភិវឌ្ឍវិជ្ជាជីវៈជាបន្តបន្ទាប់ ក្នុងនាមជាអ្នកសិក្សា អ្នកអនុវត្ត និងជាអ្នកដឹកនាំក្នុងវិស័យអប់រំ។"
          }
        ]
      }
      ]}
  ];
    return(
        <>
          {LUP_SE_PHD.map((items)=>(
            <div className=" w-full siemreap-regular  p-4">
            <h1 className="siemreap-regular text-start">
                ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា
            </h1>
            <h1 className="siemreap-regular text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
            <p className="siemreap-regular px-10 py-1 text-justify">
            &nbsp;&nbsp;&nbsp;&nbsp;{items.courseDescription}
            </p>
            <p className="siemreap-regular px-7 py-4 text-start">
                	កញ្ចប់សមត្ថភាព និងមុខវិជ្ជាគោល
            </p>
                {
                items.competencyPackages.map((_package)=>(
                <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
                    <p>{_package.title}</p>
                    {_package.subjects.map((subject, index) => (
                        <p key={index}>&nbsp;&nbsp;&nbsp;&nbsp;●	{subject}</p>
                    ))}
                </div>
                ))
                }
                <p className="siemreap-regular px-7  text-start">● លទ្ធផលសិក្សានៃកម្មវិធី (PLOs)</p>
                  <p className="siemreap-regular px-7 py-4 text-start">
                    ពេលបញ្ចប់ការសិក្សាកម្មវិធីថ្នាក់បណ្ឌិត ឯកទេសគ្រប់គ្រងអប់រំ និងយុទ្ធសាស្រ្តសហគមន៍សាលារៀនមធ្យមសិក្សា(EdD LUP) ដោយជោគជ័យ អ្នកសិក្សានឹងសមត្ថភាពដូចជា៖
                  </p>
            
                {items.programLearningOutcomes.map((_plos)=>(
                    <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
                    <p className="siemreap-regular   text-start">{_plos.category}</p>
                        {_plos.plos.map((plo,index)=>(
                            <p className="siemreap-regular px-4  text-start" key={index}>&nbsp;&nbsp;{plo.id} {plo.titleKh} {plo.titleEn} {plo.description}</p>
                        ))}
                    </div>
                ))} 

            </div>
            
          ))}
            
                       
        </>
    )
}