export default function LupSeBaProgram(){
    return(
        <>
            <div className=" w-full siemreap-regular  p-4">
            <h1 className="siemreap-regular text-start">
                ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា
            </h1>
            <h1 className="siemreap-regular text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
            <p className="siemreap-regular px-10 py-1 text-justify">
            កម្មវិធីលើកកម្ពស់គុណវុឌ្ឍិគណៈគ្រប់គ្រងសាលារៀន ថ្នាក់បរិញ្ញាបត្រ ឯកទេសគ្រប់គ្រងអប់រំ និងយុទ្ធសាស្រ្តសហគមន៍សាលារៀន(BA LUP) ត្រូវបានអនុវត្តក្រោមក្របខណ្ឌ គម្រោងកែលម្អការអប់រំចំណេះទូទៅ GEIP ដើម្បីសម្រេចគោលដៅកំណែទម្រង់វិស័យអប់រំ របស់ក្រសួងអប់រំ យុវជន និងកីឡា។ លោកនាយក នាយករង នាយិកា នាយិការង និងបុគ្គលិកអប់រំនៅតាមសាលាគោលដៅ និងសាលាទទួលផលជះ មន្រ្តីកំពុងបម្រើការងារនៅតាមការិយាល័យនៃមន្ទីរអប់រំ យុវជន និងកីឡារាជធានីខេត្ត និងនៅតាមការិយាល័យអប់រំ យុវជន និងកីឡា ក្រុង ស្រុក ខណ្ឌ ត្រូវបានលើកទឹកចិត្តឱ្យបន្តការសិក្សា ថ្នាក់បរិញ្ញាបត្រ BA LUP ដែលមានគោលបំណងបណ្ដុះបណ្ដាលឱ្យក្លាយជាភ្នាក់ងារនៃកំណែទម្រង់អប់រំ ដែលមានភស្តុតាងសម្មតិកម្មនៃការផ្លាស់ប្ដូរនៅតាមសាលារៀន នាំឱ្យមានផលសម្រេច។ 
            កម្មវិធី BA LUP ជួយអ្នកសិក្សាឱ្យទទួលបាននូវមូលដ្ឋាគ្រឹះរឹងមាំ សមស្របសម្រាប់បន្តការអភិវឌ្ឍិវិជ្ជាជីវៈជាប្រចាំ ក្នុងការលើកកម្ពស់សមត្ថភាព តាមបរិបទយុទ្ធសាស្រ្តសហគមន៍សាលារៀន និងស្តង់ដាសាលារៀនគំរូ ឆ្លើយតបជាមួយតម្រូវការ និងការវិវត្តរបស់សង្គមជាតិ និងសាកលលោក។ កម្មវិធី BA LUP ផលិតមូលធនមនុស្សក្នុងការលើកកម្ពស់គុណវុឌ្ឍិកម្រិត បរិញ្ញាបត្រអប់រំដែលអាច (១) មានមូលដ្ឋានគ្រឹះចំណេះដឹង និងចំណេះធ្វើរឹងមាំសម្រាប់ការគ្រប់គ្រង និងអភិវឌ្ឍិវិធីសាស្រ្តបង្រៀនបែបថ្មីឆ្លើយតបជាមួយសមត្ថភាពសិក្សារបស់សិស្ស ប្រកបដោយប្រសិទ្ធភាព (២) យល់ដឹង និងអនុវត្តការស្រាវជ្រាវអប់រំ ដើម្បីបង្កើនសមត្ថភាពជំនាញ និងបទពិសោធន៍បន្ថែមលើជំនាញវិជ្ជាជីវៈរបស់ខ្លួន (៣) យកចំណេះដឹងសាកលលោកមកបន្ស៊ីនឹងបរិបទមូលដ្ឋាន និងយកកម្មវិធីកំណែទម្រង់ថ្នាក់ជាតិមកអនុវត្តជាក់ស្តែងនៅសាលារៀន (៤)បង្កើតភាពជាម្ចាស់របស់សហគមន៍ក្នុងការ អភិវឌ្ឍិសាលារៀន និងកសាងទំនុកចិត្តដល់សហគមន៍តាមតួនាទី របស់ខ្លួន (៥) កសាងឥរិយាបថវិជ្ជមាន និងវប្បធម៌អភិវឌ្ឍវិជ្ជាជីវៈពេញមួយជីវិតក្នុងការដឹកនាំគ្រប់គ្រង និងរដ្ឋបាលសាលារៀន ដែលមានលក្ខណៈឆ្លើយតប និងទទួលបានផលសម្រេចប្រកបដោយ គុណភាព និងប្រសិទ្ធភាពខ្ពស់
            កម្មវិធី ថ្នាក់បរិញ្ញាបត្រ BA LUP បណ្ដុះបណ្ដាល មានចំនួន ៦៣ ក្រេឌីត និងមានកញ្ចប់សមត្ថភាពនៃកម្មវិធីសិក្សា រួមមាន៖
            (១) ចំណេះដឹងឯកទេសកម្រិតបរិញ្ញាបត្រ ៣៦ក្រេឌីត (៦០%) 
            (២) ចំណេះដឹងវិធីសាស្រ្តដឹកនាំ និងការគ្រប់គ្រងតាមសាលារៀន ១២(+៣)ក្រេឌីត (២០%)
            (៣) ហ្វឹកហាត់កម្មវិធីសិក្សា និងការអនុវត្តជាក់ស្ដែង ១២ក្រេឌីត (២០%)

            </p>
            <p className="siemreap-regular px-7 py-4 text-start">
                ●	កញ្ចប់សមត្ថភាព និងមុខវិជ្ជាគោល
            </p>
            <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
                <p>កម្មវិធីនេះអភិវឌ្ឍសមត្ថភាពគ្រប់ជ្រុងជ្រោយលើផ្នែកចំនួនបីដូចខាងក្រោម៖</p>
                <p>១. ការសិក្សាអប់រំកុមារតូច</p>
                <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
                <p>●	ការអភិវឌ្ឍការអប់រំកុមារតូច</p>
                <p>●	ការអភិវឌ្ឍគ្រប់ផ្នែករបស់កុមារតូច</p>
                <p>●	កិច្ចសហប្រតិបត្តិការ និងការគាំទ្រកុមារពីសំណាក់ ផ្ទះ-សាលារៀន-សហគមន៍</p>
                </div>
                <p>២. ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រង</p>
                <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
                <p>●	ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងរដ្ឋបាលសាលារៀន</p>
                <p>●	ការគ្រប់គ្រងអប់រំសម្រាប់បរិបទការអប់រំកុមារតូច</p>
                <p>●	យុទ្ធសាស្ត្រដឹកនាំ សាលារៀនមានប្រសិទ្ធភាព និងស្ថេរភាព</p>
                </div>
                <p>៣. ការអនុវត្ត និងនិក្ខេបបទ</p>
                <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
                <p>●	ការអនុវត្តការគ្រប់គ្រងតាមសាលារៀន (SBM)</p>
                <p>●	យុទ្ធសាស្ត្រសហគមន៍សាលារៀន (SCS)</p>
                <p>●	ការចូលរួមអនុវត្តជាក់ស្តែងនៅក្នុងបរិស្ថានសាលារៀន</p>
                <p>●	ការស្រាវជ្រាវ ការសរសេរនិក្ខេបបទ និងការរាយការណ៍ដែលស្របតាមស្តង់ដារសាលារៀនមានប្រសិទ្ធភាព និងស្ដង់ដាសាលារៀនគំរូ</p>
                </div>
            </div>
            <p className="siemreap-regular px-7 py-4 text-start">● លទ្ធផលសិក្សានៃកម្មវិធី (PLOs)</p>
            <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
                <p className="siemreap-regular text-justify">
                ● នៅពេលដែលបញ្ចប់កម្មវិធីសិក្សានេះ អ្នកសិក្សានឹងមានសមត្ថភាព៖
                <br />
                &nbsp;&nbsp;PLO1៖ ពន្យល់ឱ្យបានស៊ីជម្រៅពីទ្រឹស្តី គំនិត និងគោលការណ៍នៃការអប់រំទាំងក្នុងបរិបទសកល និងថ្នាក់ជាតិ ព្រមទាំងឆ្លុះបញ្ចាំងពីការអនុវត្តជាក់ស្តែងនៅក្នុងបរិបទការអប់រំកុមារតូច។
                <br />
                &nbsp;&nbsp;PLO2៖ ពន្យល់បានស៊ីជម្រៅពីដំណើរការអនុវត្តដែលតម្រូវ ដើម្បីបណ្តុះបណ្តាលសាលារៀនឱ្យអនុវត្តយុទ្ធសាស្ត្រសហគមន៍សាលារៀនប្រកបដោយប្រសិទ្ធភាព។
                <br />
                &nbsp;&nbsp;PLO3៖ អភិវឌ្ឍគំរូនៃភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងសាលារៀន ដោយផ្តោតលើលទ្ធផលសិក្សារបស់សិស្ស ប្រសិទ្ធភាពសាលារៀន គុណភាព និងនិរន្តរភាព តាមរយៈការរៀន ការអនុវត្ត និងការស្រាវជ្រាវ។ 
                <br />
                &nbsp;&nbsp;PLO4៖ ប្រើប្រាស់គំនិត ចំណេះដឹង និងជំនាញនៃការអភិវឌ្ឍ និងការអប់រំកុមារតូច ដើម្បីធ្វើការផ្លាស់ប្តូរវិជ្ជមាននៅក្នុងការរៀននិងការថែទាំកុមារនៅក្នុងបរិបទសាលារៀន។ 
                <br />
                &nbsp;&nbsp;PLO5៖ បង្កើតយន្តការ ការគ្រប់គ្រង តាមដាន និងវាយតម្លៃលើការអនុវត្តការគ្រប់គ្រងតាមសាលារៀន និងយុទ្ធសាស្ត្រសហគមន៍សាលារៀន នៅក្នុងការអប់រំកុមារតូច។
                <br />
                &nbsp;&nbsp;PLO6៖ អនុវត្តភាពជាអ្នកដឹកនាំ ការគ្រប់គ្រងការងារ ការប្រឹក្សាគរុកោសល្យ គំនិតផ្តួចផ្តើមបង្កើតប្រាក់ចំណូល និងកម្មវិធីគាំពារសង្គមសម្រាប់សាលារៀន និងសហគមន៍ប្រកបដោយក្រមសីលធម៌វិជ្ជាជីវៈ។
                <br />
                &nbsp;&nbsp;PLO7៖ អភិវឌ្ឍអាកប្បកិរិយាវិជ្ជមាន និងវប្បធម៌នៃការរៀនមួយជីវិត និងការទំនាក់ទំនងប្រកប ដោយការគោរព មនុស្សធម៌ សាមគ្គីភាព និងស្មារតីនៃការចែករំលែក។
                <br />
                &nbsp;&nbsp;PLO8៖ បង្ហាញផ្នត់គំនិតដឹកនាំដែលគាំទ្រដល់ការបង្កើតបណ្តាញដ៏រឹងមាំ និងលើកកម្ពស់ឧត្តមភាពនៅក្នុងស្ថាប័នគ្រប់គ្រងអប់រំ។
                </p>
            </div>
            </div>
        </>
    )
}