
export default function TupSePhdProgram(){
  const TUP_SE_PHD=[
    {
    courseDescription:"កម្មវិធីថ្នាក់បណ្ឌិត ឯកទេសវិជ្ជាជីវៈគ្រូបង្រៀននៅមធ្យមសិក្សា(EdD TUP) ត្រូវបានអនុវត្តក្រោមគម្រោងកែលម្អការអប់រំទូទៅ - ហិរញ្ញប្បទានបន្ថែម (GEIP-AF) គឺជាកម្មវិធីបណ្ឌិតអប់រំដែលត្រូវបានរៀបចំឡើងដើម្បីពង្រឹងជំនាញកម្រិតខ្ពស់ក្នុងការអភិវឌ្ឍកម្មវិធីសិក្សា ការបង្រៀន គរុកោសល្យ និងនវានុវត្តអប់រំ។ កម្មវិធីនេះមានគោលបំណងអភិវឌ្ឍអ្នកអប់រំជាន់ខ្ពស់ គ្រូឧទ្ទេស និងអ្នកដឹកនាំអប់រំ ដើម្បីកែលម្អគុណភាពបង្រៀន និងរៀនតាមរយៈវិធីសាស្រ្តដោយមានមូលដ្ឋានលើការស្រាវជ្រាវ និងផ្តោតលើការអនុវត្តជាក់ស្តែង។កម្មវិធីសិក្សាបានរួមបញ្ចូលការសិក្សាកម្រិតខ្ពស់លើទស្សនវិជ្ជាអប់រំ ទ្រឹស្តីសិក្សា កម្មវិធីសិក្សា និងការអភិវឌ្ឍការបង្រៀន បច្ចេកវិទ្យាបង្រៀន ការវាយតម្លៃសម្រាប់ការរៀនសូត្រនៅក្នុងសតវត្សរ៍ទី ២១ និងការកែលម្អការបង្រៀនដោយផ្អែកលើទិន្នន័យជាក់ស្តែង។ កម្មវិធីបណ្តុះបណ្តាលនេះបានផ្តល់ជូនអ្នកសិក្សានៃការរៀនតាមប្រព័ន្ធអ៊ីនធឺណិត និងការសិក្សាដោយផ្ទាល់ ដែលធានានូវភាពម៉ត់ចត់ ភាពបត់បែន និងភាពពាក់ព័ន្ធទៅនឹងការអនុវត្តជាក់ស្តែង។ អ្នកសិក្សាបញ្ចប់ការសិក្សាត្រូវបានរំពឹងថា នឹងបង្ហាញ វិជ្ជាជីវៈ សីលធម៌ ភាពជាអ្នកដឹកនាំគរុកោសល្យកម្រិតខ្ពស់ និងការសម្រេចចិត្តផ្អែកលើការស្រាវជ្រាវ ដែលរួមចំណែកដល់ការកែលម្អប្រកបដោយចីរភាពក្នុងការបង្រៀន ការរៀនសូត្រ និងកំណែទម្រង់កម្មវិធីសិក្សានៅកម្រិតស្ថាប័ន និងប្រព័ន្ធ។",
    competencyPackages:[
    {
      id: 1,
      title: "សមត្ថភាពចំណេះដឹងខ្លឹមសារមេរៀន (១២ ក្រេឌីត)",
      subjects: [
        "	ទស្សនវិជ្ជាអប់រំកម្រិតខ្ពស់",
        "	វិធីសាស្រ្តស្រាវជ្រាវកម្រិតខ្ពស់",
        "	បច្ចេកទេសការបង្រៀន និងកម្មវិធីសិក្សាតាមបែបឌីជីថល*",
        "	ភាពជាអ្នកដឹកនាំក្នុងកំណែទម្រង់អប់រំកម្រិតខ្ពស់*",
        "	ការវាយតម្លៃការសិក្សាក្នុងស.វទី២១ កម្រិតខ្ពស់*",
        "	ការដឹកនាំឆ្ពោះទៅកាន់បរិកាសការសិក្សាប្រកបដោយសមធម៌ និងបរិយាបន្ន*"

      ]
    },
    {
      id: 2,
      title: "សមត្ថភាពចំណេះដឹងគរុកោសល្យ និងការសិក្សាអប់រំ (១២ ក្រេឌីត)",
      subjects: [
        "	ការអនុវត្ត និងទ្រឹស្តីការរៀន និងការបង្រៀន ",
        "	ការអនុវត្ត និងក្របខណ្ឌការដឹកនាំ និងការបង្វឹក",
        "	ទ្រឹស្តីការរៀន និងការបង្រៀនកម្រិតខ្ពស់",
        "	ការវាយតម្លៃកម្មវិធីសិក្សា និងការបង្រៀន",
        "	ការកែលម្អការបង្រៀនដោយផ្អែកលើទិន្នន័យ"

      ]
    },
    {
      id: 3,
      title: "សមត្ថភាពចំណេះដឹងសិក្សាស្រាវជ្រាវ និងការអនុវត្តជាក់ស្តែង (៣៣ ក្រេឌីត)",
      subjects: [
        "	សំណើរនិក្ខេបបទស្រាវជ្រាវ",
        "	និក្ខេបបទស្រាវជ្រាវ (ការបោះពុម្ពអត្ថបទស្រាវជ្រាវ ការចូលរួមជាវាគ្មិនក្នុងសិក្ខាសាលាស្រាវជ្រាវថ្នាក់ជាតិ និងអន្តរជាតិ...)។",
        "សម្គាល់៖ មុខវិជ្ជាមានសញ្ញា * ជាមុខវិជ្ជាជម្រើស"
      ]
    }],
    programLearningOutcomes:[
      {
        category: "",
        plos: [
          {
            id: "PLO1",
            titleKh: "",
            titleEn: "",
            description: "ចំណេះដឹងកម្រិតខ្ពស់៖ បង្ហាញពីចំណេះដឹងកម្រិតខ្ពស់ និងរួមបញ្ចូលគ្នានៃកម្មវិធីសិក្សា ការបង្រៀន គរុកោសល្យ ការវាយតម្លៃ និងបច្ចេកវិទ្យាបង្រៀនដោយផ្អែកលើទ្រឹស្តីអប់រំសហសម័យ និងការស្រាវជ្រាវ។"
          },
          {
            id: "PLO2",
            titleKh: "",
            titleEn: "",
            description: "សមត្ថភាពការសិក្សាស្រាវជ្រាវ៖ រៀបចំ អនុវត្ត និងវាយតម្លៃការស្រាវជ្រាវដោយប្រើវិធីសាស្រ្តតាមបែបគុណវិស័យ បរិមាណវិស័យ និងវិធីសាស្រ្តស្រាវជ្រាវតាមបែបចម្រុះសមស្រប ដើម្បីដោះស្រាយបញ្ហាទាក់ទងនឹងការបង្រៀន និងកម្មវិធីសិក្សា។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO3",
            titleKh: "",
            titleEn: "",
            description: "បំណិនការត្រឹះរិះពិចារណា និងវិភាគតាមបែបស៊ីជម្រៅ៖ វិភាគដោយត្រឹះរិះពិចារណា អំពីបញ្ហាទាក់ទងនឹងការបង្រៀន ការរៀន និងការអភិវឌ្ឍកម្មវិធីសិក្សា ដោយផ្អែកលើភស្តុតាង ទិន្នន័យ និងឆ្លើយតបទៅនឹងបរិបទនានា។"
          },
          {
            id: "PLO4",
            titleKh: "",
            titleEn: "",
            description: "សមត្ថភាពភាពជាអ្នកដឹកនាំផ្នែកបង្រៀន និងគរុកោសល្យ៖ បង្ហាញពីសមត្ថភាពជាអ្នកដឹកនាំកម្រិតខ្ពស់ក្នុងការត្រួតពិនិត្យ ការបង្វឹក និងការកែលម្អការអនុវត្តការបង្រៀន និងការរៀន រួមទាំងបរិយាកាសសិក្សាដែលប្រកបដោយសមធម៌ និងបរិយាបន្ន។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO5",
            titleKh: "",
            titleEn: "",
            description: "ជំនាញការអភិវឌ្ឍកម្មវិធីសិក្សា និងការវាយតម្លៃ៖ អភិវឌ្ឍ វាយតម្លៃ និងកែលម្អកម្មវិធីសិក្សា កម្មវិធីបង្រៀន និងប្រព័ន្ធវាយតម្លៃ ដែលស្របតាមអាទិភាពកំណែទម្រង់ការរៀនសូត្រ និងការអប់រំសតវត្សរ៍ទី២១។"
          },
          {
            id: "PLO6",
            titleKh: "",
            titleEn: "",
            description: "ជំនាញទំនាក់ទំនង និងការផ្សព្វផ្សាយ៖ ទំនាក់ទំនងការស្រាវជ្រាវ និងការយល់ដឹងវិជ្ជាជីវៈប្រកបដោយប្រសិទ្ធភាពតាមរយៈការសរសេរសិក្សា បទបង្ហាញសន្និសីទ និងការបោះពុម្ពផ្សាយសិក្សាស្រាវជ្រាវតាមបែបវិទ្យាសាស្រ្ត។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO7",
            titleKh: "",
            titleEn: "",
            description: "បំណិននវានុវត្តន៍ និងការកែលម្អការអប់រំ៖ អនុវត្តដំណោះស្រាយប្រកបដោយភាពច្នៃប្រឌិត និងប្រកបដោយចីរភាព ដើម្បីលើកកម្ពស់គុណភាពការបង្រៀន កំណែទម្រង់កម្មវិធីសិក្សា និងការកែលម្អការអប់រំដោយផ្អែកលើទិន្នន័យជាមូលដ្ឋាន។"
          },
          {
            id: "PLO8",
            titleKh: "",
            titleEn: "",
            description: "សមត្ថភាពអនុវត្តប្រកបដោយក្រមសីលធម៌ និងការទទួលខុសត្រូវវិជ្ជាជីវៈ៖ បង្ហាញពីសុចរិតភាព ការអនុវត្តតាមក្រមសីលធម៌ និងការទទួលខុសត្រូវសង្គមក្នុងការស្រាវជ្រាវអប់រំ និងការអនុវត្តប្រកបដោយវិជ្ជាជីវៈ។"
          }
        ]
      },
      {
        category: "",
        plos: [
          {
            id: "PLO9",
            titleKh: "",
            titleEn: "",
            description: "បំណិនការសិក្សាពេញមួយជីវិត៖ ចូលរួមក្នុងការអភិវឌ្ឍសមត្ថភាពវិជ្ជាជីវៈជាបន្តបន្ទាប់ និងការរៀនសូត្រពេញមួយជីវិត ក្នុងនាមជាអ្នកសិក្សា និងអ្នកអនុវត្តតាមរយៈការឆ្លុះបញ្ចាំង និងការអនុវត្តដោយផ្ទាល់។"
          }
        ]
      }
      ]}
  ];
    return(
        <>
          {TUP_SE_PHD.map((items)=>(
            <div className=" w-full siemreap-regular  p-4">
            <h1 className="siemreap-regular text-start">
                ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា
            </h1>
            <h1 className="siemreap-regular text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
            <p className="siemreap-regular px-10 py-1 text-justify">
            &nbsp;&nbsp;&nbsp;&nbsp;{items.courseDescription}
            </p>
            <p className="siemreap-regular px-7 py-4 text-start">
                	កញ្ចប់សមត្ថភាព និងមុខវិជ្ជាគោល
            </p>
                {
                items.competencyPackages.map((_package)=>(
                <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
                    <p>{_package.title}</p>
                    {_package.subjects.map((subject, index) => (
                        <p key={index}>&nbsp;&nbsp;&nbsp;&nbsp;●	{subject}</p>
                    ))}
                </div>
                ))
                }
                <p className="siemreap-regular px-7  text-start">● លទ្ធផលសិក្សានៃកម្មវិធី (PLOs)</p>
                  <p className="siemreap-regular px-7 py-4 text-start">
                    ពេលបញ្ចប់ការសិក្សាកម្មវិធីថ្នាក់បណ្ឌិត ឯកទេសគ្រប់គ្រងអប់រំ និងយុទ្ធសាស្រ្តសហគមន៍សាលារៀនមធ្យមសិក្សា(EdD LUP) ដោយជោគជ័យ អ្នកសិក្សានឹងសមត្ថភាពដូចជា៖
                  </p>
            
                {items.programLearningOutcomes.map((_plos)=>(
                    <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
                    <p className="siemreap-regular   text-start">{_plos.category}</p>
                        {_plos.plos.map((plo,index)=>(
                            <p className="siemreap-regular px-4  text-start" key={index}>&nbsp;&nbsp;{plo.id} {plo.titleKh} {plo.titleEn} {plo.description}</p>
                        ))}
                    </div>
                ))} 

            </div>
            
          ))}
            
                       
        </>
    )
}