function LupEceBaProgram() {
    return(
      <div className=" w-full siemreap-regular  p-4">
      <h1 className="siemreap-regular text-start">
        ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា
      </h1>
      <h1 className="siemreap-regular  text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
      <p className="siemreap-regular  px-7 py-4 text-start">● ការណែនាំអំពីកម្មវិធី</p>
      <p className="siemreap-regular  px-10 py-1 text-justify">
        កម្មវិធីនេះត្រូវបានរៀបចំឡើងដើម្បីត្រៀមលក្ខណៈអ្នកសិក្សាឱ្យក្លាយជាអ្នកដឹកនាំ និងអ្នកអប់រំប្រកបដោយសមត្ថភាព នវានុវត្តន៍ និងកំណែទម្រង់ ក្នុងការអភិវឌ្ឍកុមារតូច។ កម្មវិធីនេះណែនាំដល់អ្នកសិក្សានូវទ្រឹស្ដីសំខាន់ៗ គោលការណ៍ និងទស្សនៈ នៃការអប់រំកុមារតូច ការគ្រប់គ្រងអប់រំ និងយុទ្ធសាស្ត្រដៃគូររវាងសាលារៀន និងសហគមន៍។ កម្មវិធីនេះផ្សារភ្ជាប់មូលដ្ឋានគ្រឹះ ទ្រឹស្ដី ទៅនឹងបទពិសោធន៍ពិតជាក់ស្ដែងនៅក្នុងបរិបទសាលារៀនដោយមានគោលបំណងច្បាស់លាស់ ដែលអាចឱ្យអ្នកសិក្សាបណ្ដុះនូវការអនុវត្តប្រកបដោយសមត្ថភាព ភស្តុតាងច្បាស់លាស់ និងសកម្មភាពពាក់ព័ន្ធផ្ដោតលើការលើកកម្ពស់ការរៀន និងការអភិវឌ្ឍរបស់កុមារតូច។
        ដោយផ្តោតលើការកែលម្អសាលារៀន ភាពជាអ្នកដឹកនាំប្រកបដោយប្រសិទ្ធភាព និងសកម្មភាពអប់រំដែលមានស្ថេរភាព កម្មវិធីនេះ ផ្ដល់នូវ ចំណេះជំនាញទៅដល់គ្រូបង្រៀន និងគណៈគ្រប់គ្រងសាលារៀន ដើម្បីឱ្យពួកគាត់ក្លាយជាភ្នាក់ងារកំណែទម្រង់វិជ្ជមាន។ តាមរយៈការកសាងសមត្ថភាព និងការសិក្សាគរុកោសល្យបែបឆ្លុះបញ្ចាំង អ្នកសិក្សាទទួលបានការត្រៀមលក្ខណៈដើម្បីអាចផ្ដួចផ្ដើម អនុវត្ត និងរក្សាការកែលម្អដែលមានសារៈសំខាន់សម្រាប់លទ្ធផលសិក្សារបស់កុមារ និងសម្រាប់គុណភាពនៃសេវាអប់រំកុមារតូចក្នុងសាលារៀន និងសហគមន៍របស់ខ្លួន។
      </p>
      <p className="siemreap-regular  px-7 py-4 text-start">
        ● កម្មវិធីរួមបញ្ចូល (មុខវិជ្ជាគោល)
      </p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
        <p>កម្មវិធីនេះបណ្ដុះនូវសមត្ថភាពសំខាន់ៗ ពេញលេញ និងផ្ដោតលើការអនុវត្តជាក់ស្ដែងលើផ្នែកបីសំខាន់ៗគឺ៖</p>
        <p>១. បច្ចេកវិទ្យាអប់រំ និងប្រព័ន្ធតាមដានទិន្នន័យសិក្សា</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	វប្បធម៌សាលារៀនដែលគាំទ្រដល់ការលូតលាស់សុខុមាលភាពរបស់កុមារ</p>
          <p>
            ●	ការអភិវឌ្ឍគ្រប់ផ្នែករបស់កុមារ និងតម្រូវការសិក្សានានា
          </p>
          <p>●	សហប្រតិបត្តិការរវាងសាលារៀន និងសហគមន៍ដែលរួមចំណែកក្នុងការកែលម្អបរិយាកាសសិក្សា</p>
        </div>
        <p>២. កម្មវិធីសិក្សា គរុកោសល្យ និងនវានុវត្តន៍</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>
            ●	ភាពជាអ្នកដឹកនាំដែលមានការតម្រង់ទិស និងរដ្ឋបាលច្បាស់លាស់
          </p>
          <p>●	ការគ្រប់គ្រងសាលារៀនប្រកបដោយយុទ្ធសាស្ត្រ និងប្រសិទ្ធភាព</p>
          <p>●	ការសម្រេចចិត្តដោយផ្អែកលើភស្តុតាងច្បាស់លាស់ក្នុងបរិបទអប់រំកុមារតូច</p>
        </div>
        <p>៣. ភាពជាអ្នកដឹកនាំ ការគ្រប់គ្រងរដ្ឋបាល និងការអនុវត្ត</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	ការអនុវត្តការគ្រប់គ្រងកម្រិតសាលារៀន (SBM)</p>
          <p>●	យុទ្ធសាស្ត្រសហគមន៍សាលារៀនដើម្បីលើកកម្ពស់កម្មវិធីអប់រំកុមារតូច</p>
          <p>
            ●	ការប្រើប្រាស់ និងបកស្រាយស្ដង់ដាសាលារៀនមានប្រសិទ្ធភាព
          </p>
          <p>
            ●	សកម្មភាពកម្មសិក្សា ការចុះអនុវត្តជាក់ស្ដែង និងរបាយការណ៍ឆ្លុះបញ្ចាំង ដើម្បីពង្រឹងការអនុវត្តវិជ្ជាជីវៈ
          </p>
        </div>
      </div>
      <p className="siemreap-regular  px-7 py-4 text-start">● លទ្ធផលសិក្សានៃកម្មវិធី (PLOs)</p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
        <p className="siemreap-regular text-justify">
          ● នៅពេលដែលបញ្ចប់កម្មវិធីសិក្សានេះ អ្នកសិក្សានឹងមានសមត្ថភាព៖
          <br />
          &nbsp;&nbsp;PLO1៖ បង្ហាញនូវចំណេះដឹងអំពីរបៀប អភិវឌ្ឍសាលារៀនដែលគាំទ្រដល់សហគមន៍សាលារៀន។
          <br />
          &nbsp;&nbsp;PLO2៖ ពន្យល់អំពីគោលគំនិតនៃភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងអប់រំក្នុងការអប់រំកុមារតូច ការគ្រប់គ្រងតាមសាលារៀន (SBM) និងយុទ្ធសាស្ត្រសហគមន៍សាលារៀន (SCS)។
          <br />
          &nbsp;&nbsp;PLO3៖ អនុវត្តភារកិច្ចគ្រប់គ្រងសាលារៀន  យុទ្ធសាស្ត្រ និងសកម្មភាពដឹកនាំដែលមានប្រសិទ្ធភាពឈានទៅរកស្ថេរភាពសាលារៀន។
          <br />
          &nbsp;&nbsp;PLO4៖ ប្រើប្រាស់ទស្សនៈ ចំណេះដឹង និងជំនាញនៃការអភិវឌ្ឍ និងការអប់រំកុមារតូច ដើម្បីបង្កើតឱ្យមានការផ្លាស់ប្ដូរក្នុងការអប់រំ និងថែទាំកុមារនៅសាលារៀន។
          <br />
          &nbsp;&nbsp;PLO5៖ បង្កើតយន្តការគ្រប់គ្រង តាមដាន និងវាយតម្លៃទៅលើការអនុវត្តការគ្រប់គ្រងសាលារៀន និងយុទ្ធសាស្ត្រសហគមន៍សាលារៀននៅកម្រិតមត្តេយ្យសិក្សា។
          <br />
          &nbsp;&nbsp;PLO6៖ ប្រើប្រាស់ ឧបករណ៍រង្វាយតម្លៃស្ដង់ដាសាលាមានប្រសិទ្ធភាពសម្រាប់ការអប់រំកុមារតូចដោយមានទំនុកចិត្ត និងមានសមត្ថភាពផ្ដល់ការបង្វឹកដល់សាលារៀនដោយមានវិជ្ជាជីវៈ។
          <br />
          &nbsp;&nbsp;PLO7៖ បង្ហាញនូវភាពច្នៃប្រឌិតក្នុងការក្លាយជាភ្នាក់ងារកំណែទម្រង់ក្នុងការអប់រំកុមារតូចតាមរយៈការអភិវឌ្ឍចិត្តសង្គម វប្បធម៌ទំនាក់ទំនងដោយមានប្រសិទ្ធិភាព និងវិធីសាស្ត្ររៀនពេញមួយជីវិត។
          <br />
          &nbsp;PLO8៖ មានឥរិយាបថវិជ្ជមាន និងទំនុកចិត្ត ស្មារតីទំនួលខុសត្រូវ គណនេយ្យភាព និងជំនាញវិជ្ជាជីរៈ និងបំណិនជីវិត សម្រាប់ប្រើប្រាស់នូវចំណេះ និងជំនាញការអប់រំកុមារតូច និងការរស់នៅប្រកបដោយសេចក្ដីថ្លៃថ្នូរនៅក្នុងសង្គម។
        </p>
      </div>
    </div>
    )
}

export default LupEceBaProgram