import { useState } from "react";
function TeachEceBaDetail() {
  const [hide, setHide] = useState({
    hideSection1:true,
    hideSection2:true
  });
  const toggleSection = (sectionKey) => {
    setHide(prev => ({
      ...prev,
      [sectionKey]: !prev[sectionKey]
    }));
  };
  
  return (
    <div className=" w-full siemreap-regular  p-4">
      <h1 className="siemreap-regular text-start">
        ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា
      </h1>
      <h1 className="siemreap-regular  text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
      <p className="siemreap-regular  px-7 py-4 text-start">● ការណែនាំអំពីកម្មវិធី</p>
      <p className="siemreap-regular  px-10 py-1 text-justify">
        កម្មវិធីនេះត្រូវបានរៀនចំឡើងដើម្បីបណ្ដុះអ្នកអប់រំដែលមានសមត្ថភាពគាំទ្រដល់ការសិក្សា 
        និងការអភិវឌ្ឍទាំងអស់របស់កុមារតូច។ ដោយផ្អែកលើទ្រឹស្ដីការអភិវឌ្ឍរបស់កុមារ 
        ការសិក្សាអំពីកម្មវិធីសិក្សា រចនាបទណែនាំ និងការវាយតម្លៃការសិក្សាកុមារ 
        កម្មវិធីនេះបានត្រៀមលក្ខណៈរបស់អ្នកសិក្សាដើម្បីយល់ដឹងអំពីរបៀបដែលកុមារលូតលាស់ រៀន និងមានទំនាក់ទំនងនៅក្នុងបរិស្ថាន។
        កម្មវិធីនេះសង្កត់ធ្ងន់លើការយល់ដឹងអំពីទ្រឹស្ដី ជាមួយការអនុវត្តជាក់ស្ដែង។ អ្នកសិក្សាចូលរួមក្នុងបទពិសោធន៍នៅសាលារៀន 
        ការអនុវត្តបែបឆ្លុះបញ្ចាំង និងសកម្មភាពពាក់ព័ន្ធនឹងសហគមន៍ ដែលជួយពួកគេប្រែក្លាយចំណេះដឹងទៅជាការបង្រៀន 
        ភាពជាអ្នកដឹកនាំ និងការដោះស្រាយបញ្ហាដោយមានប្រសិទ្ធភាព។ ដោយផ្ដោតសំខាន់លើក្រមសីលធម៌ ការទំនាក់ទំនង 
        ភាពច្នៃប្រឌិត និងទំនួលខុសត្រូវវិជ្ជាជីវៈ អ្នកបញ្ចប់ការសិក្សាអាចត្រៀមខ្លួនរួចរាល់ក្នុងការរួមចំណែកយ៉ាងសំខាន់ក្នុងការកែលម្អការអប់រំកុមារតូចនៅសាលារៀន 
        និងសហគមន៍របស់ខ្លួន។

      </p>
      <p className="siemreap-regular  px-7 py-4 text-start">
        ● កម្មវិធីរួមបញ្ចូល (មុខវិជ្ជាគោល)
      </p>
      <p className="siemreap-regular  px-7 py-4 text-start">
        កម្មវិធីនេះបណ្ដុះសមត្ថភាពសំខាន់ៗលើផ្នែកចំនួនបីដូចខាងក្រោម៖
      </p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start ">
        <p onClick={()=>toggleSection('hideSection1')} className="hover:underline hover:text-[#3396D3] cursor-pointer">១. ការសិក្សាការអប់រំកុមារតូច</p>
        <div className={`${hide.hideSection1 ? "hidden":"siemreap-regular  px-12 py-1 flex flex-col items-start"}`}>
          <p>●	ការអភិវឌ្ឍ និងការរៀនរបស់កុមារ</p>
          <p>
            ●	កម្មវិធីសិក្សា និងវិធីសាស្ត្របង្រៀនកុមារតូច
          </p>
          <p>
            ●	រចនាបទរណែនាំ និងការបង្កើតឧបករណ៍
          </p>
          <p>
            ●	រង្វាយតម្លៃការសិក្សា
          </p>
        </div>
        <p onClick={()=>toggleSection('hideSection2')} className="hover:underline hover:text-[#3396D3] cursor-pointer">២. ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រង</p>
        <div className={`${hide.hideSection2 ? "hidden":"siemreap-regular  px-12 py-1 flex flex-col items-start"}`}>
          <p>
            ●	ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងរដ្ឋបាលសាលារៀន
          </p>
          <p>●	ការស្រាវជ្រាវអប់រំ និងការអនុវត្តវិជ្ជាជីវៈ</p>
          <p>●	ការគ្រប់គ្រងកម្មវិធីកុមារតូច</p>
        </div>
        <p>៣. ការអនុវត្ត និងការរាយការណ៍</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	ការអនុវត្តការគ្រប់គ្រងតាមសាលារៀន</p>
          <p>●	យុទ្ធសាស្ត្រទំនាក់ទំនងរវាងសាលារៀន និងសហគមន៍</p>
          <p>
            ●	ការអនុវត្តស្ដង់ដាសាលារៀនមានប្រសិទ្ធភាពសម្រាប់មត្តេយ្យសិក្សា
          </p>
          <p>
            ●	បទពិសោធន៍ជាក់ស្ដែង និងរបាយការណ៍ឆ្លុះបញ្ចាំង
          </p>
        </div>
      </div>
      <p className="siemreap-regular  px-7 py-4 text-start">● លទ្ធផលសិក្សារំពឹងទុកនៃកម្មវិធី</p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
        <p className="siemreap-regular text-justify">
           នៅពេលដែលបញ្ចប់កម្មវិធីសិក្សានេះ អ្នកសិក្សានឹងមានសមត្ថភាព៖
          <br />
          &nbsp;&nbsp;PLO1៖ បង្ហាញពីការយល់ដឹងនូវទ្រឹស្ដីជាច្រើនទាក់ទងទៅនឹងការអភិវឌ្ឍ 
          និងការរៀនរបស់កុមារ កម្មវិធីសិក្សាការអប់រំកុមារតូច និងរចនាបទណែនាំ និងរង្វាយតម្លៃការរៀនរបស់កុមារតូច។
          <br />
          &nbsp;&nbsp;PLO2៖ ពន្យល់ពីទ្រឹស្ដីការអប់រំ ការស្រាវជ្រាវអប់រំ និងគរុកោសល្យបានត្រឹមត្រូវ។
          <br />
          &nbsp;&nbsp;PLO3៖ បង្កើតកម្មវិធីសិក្សាដែលអាចអនុវត្តបាន វិធីសាស្ត្របង្រៀនមានប្រសិទ្ធភាព និងឧបករណ៍សិក្សា 
          និងរង្វាយតម្លៃការសិក្សា សម្រាប់អនុវត្តនៅសាលារៀនដើម្បីគាំទ្រដល់កម្មវិធីសិក្សារបស់កុមារតូច និងតម្រូវការរៀននានារបស់កុមារ។
          <br />
          &nbsp;&nbsp;PLO4៖ ប្រើប្រាស់ទស្សនៈ ចំណេះដឹង និងជំនាញនៃការលូតលាស់ និងការអប់រំកុមារតូចដើម្បីបង្កើតការផ្លាស់ប្ដូរក្នុងការអប់រំ 
          និងថែទាំកុមារនៅកម្រិតសាលារៀន។
          <br />
          &nbsp;&nbsp;PLO5៖ ប្រើប្រាស់វិធីសាស្ត្របង្រៀនដែលសមស្របបែបច្នៃប្រឌិត ដើម្បីឆ្លើយតបទៅនឹងកម្មវិធីសិក្សាការអប់រំចំណេះទូទៅ។
          <br />
          &nbsp;&nbsp;PLO6៖ ប្រើប្រាស់ឧបករណ៍រង្វាយតម្លៃស្ដង់ដាសាលារៀនមានប្រសិទ្ធភាពដោយទំនុកចិត្ត សម្រាប់ការអប់រំកុមារតូច  
          និងអាចផ្ដល់ការបង្វឹកដល់សាលារៀនប្រកបដោយវិជ្ជាជីវៈ។
          <br />
          &nbsp;&nbsp;PLO7៖ បង្ហាញពីភាពច្នៃប្រឌិតដើម្បីក្លាយជាភ្នាក់ងារកំណែទម្រង់ក្នុងការអប់រំកុមារតូច 
          ការលូតលាស់ផ្នែកចិត្តសង្គម វប្បធម៌ទំនាក់ទំនងមានប្រសិទ្ធិភាព និងវិធីសាស្ត្ររៀនពេញមួយជីវិត។
          <br />
          &nbsp;&nbsp;PLO8៖ បណ្ដុះនូវឥរិយាបថវិជ្ជមាន និងភាពក្លាហាន ស្មារតីទំនួលខុសត្រូវ គណនេយ្យភាព និងបំណិនជីវិត 
          និងជំនាញវិជ្ជាជីវៈសម្រាប់ប្រើប្រាស់នូវចំណេះដឹង និងជំនាញការអប់រំកុមារតូច និងរស់នៅដោយសេចក្ដីថ្លៃថ្នូរក្នុងសង្គម។
        </p>
      </div>
    </div>
  );
}

export default TeachEceBaDetail;
