function LupEcePhdProgram() {
    return(
      <div className=" w-full siemreap-regular  p-4">
      <h1 className="siemreap-regular text-start">
        ការពិពណ៌នាមុខវិជ្ជា និងលទ្ធផលការសិក្សា
      </h1>
      <h1 className="siemreap-regular text-start px-5 py-4">ការពិពណ៌នាអំពីកម្មវិធី</h1>
      <p className="siemreap-regular px-7 py-4 text-start">● ការណែនាំអំពីកម្មវិធី</p>
      <p className="siemreap-regular px-10 py-1 text-justify">
      កម្មវិធីនេះត្រូវបានរៀបចំឡើងដើម្បីត្រៀមលក្ខណៈអ្នកសិក្សា ឱ្យក្លាយជាអ្នកអប់រំដែលមានគុណវុឌ្ឍិ និងជាភ្នាក់ងារនៃការផ្លាស់ប្តូរនៅក្នុងការអភិវឌ្ឍកុមារតូច។ កម្មវិធីនេះផ្តល់នូវការយល់ដឹងស៊ីជម្រៅអំពី មូលដ្ឋានគ្រឹះទ្រឹស្តី និងទស្សនៈគោលនៃការអប់រំកុមារតូច ការគ្រប់គ្រងអប់រំ និងយុទ្ធសាស្ត្រសហគមន៍សាលារៀន។ កម្មវិធីនេះផ្សារភ្ជាប់ទ្រឹស្តីជាមួយការអនុវត្តជាក់ស្តែងនៅសាលារៀន ដោយសង្កត់ធ្ងន់យ៉ាងខ្លាំងលើការលើកកម្ពស់ការរៀន និងការអភិវឌ្ឍរបស់កុមារតូច។ តាមរយៈការរួមបញ្ចូលទ្រឹស្តី និងការអនុវត្ត អ្នកសិក្សានឹងអភិវឌ្ឍចំណេះដឹងជាក់ស្តែង សមត្ថភាពដឹកនាំ និងជំនាញវិជ្ជាជីវៈដែលចាំបាច់ ដើម្បីកែលម្អការអប់រំកុមារតូចនៅកម្រិតសាលារៀន និងសហគមន៍។
      </p>
      <p className="siemreap-regular px-7 py-4 text-start">
        ●	ខ្លឹមសារនៃកម្មវិធីសិក្សា (មុខវិជ្ជាគោល)
      </p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
        <p>កម្មវិធីនេះអភិវឌ្ឍសមត្ថភាពគ្រប់ជ្រុងជ្រោយលើផ្នែកចំនួនបីដូចខាងក្រោម៖</p>
        <p>១. ការសិក្សាអប់រំកុមារតូច</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	ការអភិវឌ្ឍការអប់រំកុមារតូច</p>
          <p>●	ការអភិវឌ្ឍគ្រប់ផ្នែករបស់កុមារតូច</p>
          <p>●	កិច្ចសហប្រតិបត្តិការ និងការគាំទ្រកុមារពីសំណាក់ ផ្ទះ-សាលារៀន-សហគមន៍</p>
        </div>
        <p>២. ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រង</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	ភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងរដ្ឋបាលសាលារៀន</p>
          <p>●	ការគ្រប់គ្រងអប់រំសម្រាប់បរិបទការអប់រំកុមារតូច</p>
          <p>●	យុទ្ធសាស្ត្រដឹកនាំ សាលារៀនមានប្រសិទ្ធភាព និងស្ថេរភាព</p>
        </div>
        <p>៣. ការអនុវត្ត និងនិក្ខេបបទ</p>
        <div className="siemreap-regular px-12 py-1 flex flex-col items-start">
          <p>●	ការអនុវត្តការគ្រប់គ្រងតាមសាលារៀន (SBM)</p>
          <p>●	យុទ្ធសាស្ត្រសហគមន៍សាលារៀន (SCS)</p>
          <p>●	ការចូលរួមអនុវត្តជាក់ស្តែងនៅក្នុងបរិស្ថានសាលារៀន</p>
          <p>●	ការស្រាវជ្រាវ ការសរសេរនិក្ខេបបទ និងការរាយការណ៍ដែលស្របតាមស្តង់ដារសាលារៀនមានប្រសិទ្ធភាព និងស្ដង់ដាសាលារៀនគំរូ</p>
        </div>
      </div>
      <p className="siemreap-regular px-7 py-4 text-start">● លទ្ធផលសិក្សានៃកម្មវិធី (PLOs)</p>
      <div className="siemreap-regular px-10 py-1 flex flex-col items-start">
        <p className="siemreap-regular text-justify">
          ● នៅពេលដែលបញ្ចប់កម្មវិធីសិក្សានេះ អ្នកសិក្សានឹងមានសមត្ថភាព៖
          <br />
          &nbsp;&nbsp;PLO1៖ ពន្យល់ឱ្យបានស៊ីជម្រៅពីទ្រឹស្តី គំនិត និងគោលការណ៍នៃការអប់រំទាំងក្នុងបរិបទសកល និងថ្នាក់ជាតិ ព្រមទាំងឆ្លុះបញ្ចាំងពីការអនុវត្តជាក់ស្តែងនៅក្នុងបរិបទការអប់រំកុមារតូច។
          <br />
          &nbsp;&nbsp;PLO2៖ ពន្យល់បានស៊ីជម្រៅពីដំណើរការអនុវត្តដែលតម្រូវ ដើម្បីបណ្តុះបណ្តាលសាលារៀនឱ្យអនុវត្តយុទ្ធសាស្ត្រសហគមន៍សាលារៀនប្រកបដោយប្រសិទ្ធភាព។
          <br />
          &nbsp;&nbsp;PLO3៖ អភិវឌ្ឍគំរូនៃភាពជាអ្នកដឹកនាំ និងការគ្រប់គ្រងសាលារៀន ដោយផ្តោតលើលទ្ធផលសិក្សារបស់សិស្ស ប្រសិទ្ធភាពសាលារៀន គុណភាព និងនិរន្តរភាព តាមរយៈការរៀន ការអនុវត្ត និងការស្រាវជ្រាវ។ 
          <br />
          &nbsp;&nbsp;PLO4៖ ប្រើប្រាស់គំនិត ចំណេះដឹង និងជំនាញនៃការអភិវឌ្ឍ និងការអប់រំកុមារតូច ដើម្បីធ្វើការផ្លាស់ប្តូរវិជ្ជមាននៅក្នុងការរៀននិងការថែទាំកុមារនៅក្នុងបរិបទសាលារៀន។ 
          <br />
          &nbsp;&nbsp;PLO5៖ បង្កើតយន្តការ ការគ្រប់គ្រង តាមដាន និងវាយតម្លៃលើការអនុវត្តការគ្រប់គ្រងតាមសាលារៀន និងយុទ្ធសាស្ត្រសហគមន៍សាលារៀន នៅក្នុងការអប់រំកុមារតូច។
          <br />
          &nbsp;&nbsp;PLO6៖ អនុវត្តភាពជាអ្នកដឹកនាំ ការគ្រប់គ្រងការងារ ការប្រឹក្សាគរុកោសល្យ គំនិតផ្តួចផ្តើមបង្កើតប្រាក់ចំណូល និងកម្មវិធីគាំពារសង្គមសម្រាប់សាលារៀន និងសហគមន៍ប្រកបដោយក្រមសីលធម៌វិជ្ជាជីវៈ។
          <br />
          &nbsp;&nbsp;PLO7៖ អភិវឌ្ឍអាកប្បកិរិយាវិជ្ជមាន និងវប្បធម៌នៃការរៀនមួយជីវិត និងការទំនាក់ទំនងប្រកប ដោយការគោរព មនុស្សធម៌ សាមគ្គីភាព និងស្មារតីនៃការចែករំលែក។
          <br />
          &nbsp;&nbsp;PLO8៖ បង្ហាញផ្នត់គំនិតដឹកនាំដែលគាំទ្រដល់ការបង្កើតបណ្តាញដ៏រឹងមាំ និងលើកកម្ពស់ឧត្តមភាពនៅក្នុងស្ថាប័នគ្រប់គ្រងអប់រំ។
        </p>
      </div>
    </div>
    )
}

export default LupEcePhdProgram